{
    "title":"TrekTales",
    "nav1":"Home",
    "nav2":"About",
    "nav3":"Top Post",
    "nav4":"Contact",
    "heading":"Welcome to Wanderlust Adventures!",
    "subhead":"Are you ready to embark on a journey of discovery, exploration, and unforgettable experiences? ",
    
    "blog1Title":"Best places to visit during ICC World Cup in Mumbai",
    "blog1postby":"Posted By Durvesh Chaudhari on 4/02/2024",
    "blog1Content1":"The bustling metropolis of Mumbai is alive with expectation as the cricketing world prepares for the ICC World Cup. Any cricket fan would have a fantastic time attending the Mumbai ICC World Cup! Mumbai provides a wealth of anticipation, excitement, and activities to experience during your vacation, in addition to cricket matches.<br><br><b>Summary</b><br><br>The bustling metropolis of Mumbai is alive with expectation as the cricketing world prepares for the ICC World Cup. Any cricket fan would have a fantastic time attending the Mumbai ICC World Cup! Mumbai provides a wealth of anticipation, excitement, and activities to experience during your vacation, in addition to cricket matches.There are many places to visit during the ICC World Cup in Mumbai, which will enhance your travel experience manifolds.Mumbai's top attractions are listed below: <br><br>",
    "blog1Content2":"<h2>1. Gateway of India</h2><br>The Gateway of India is a famous landmark and historical structure in Mumbai and a must-see location. To honour the first visit to India by King George V and Queen Mary, this magnificent monument was built in 1924. is a well-liked location among both visitors and residents since it provides a stunning view of the Arabian Sea. It's a fantastic location for taking photos and enjoying the sea breeze.<br><br>",
    "blog1Content3":"<h2>2. Chhatrapati Shivaji Maharaj Vastu Sangrahalaya</h2><br>Previously, it was known as the Prince of Wales Museum. Its intriguing architecture is a fusion of Hindu, Islamic, and British influences.It was created in 1923 and was the work of George Wittet under three headings—Art, Archaeology, and Natural History.It holds more than 50,000 artefacts from ancient Indian history and those from other nations. It is home to a sizable collection of historical relics, works of art, and exhibits that give visitors a glimpse into India's illustrious past and culture.<br><i>Opening time: Monday to Sunday, 10.15 am to 6.00 pm.</i><br><br>",
    "blog1Content4":"<h2>3. Marine Drive</h2><br>Marine Drive certainly inscribed its name on the list when we are talking about the best places to visit during ICC World Cup in Mumbai.Enjoy a stroll down a stunningly lit-up night at Marine Drive. It is also popularly referred to as the Queen's Necklace.A stunning arch-shaped road runs along the coast. The Marine Drive promenade is spacious and well-kept, perfect for nighttime strolls, running, and relaxing.After dusk, the entire semi-circular Marine Drive appears gleaming with street lights.<br><br>",
    "blog1Content5":"<h2>4. Colaba Causeway</h2><br>Those who enjoy shopping will love this crowded street market. A thriving South Mumbai Street market that offers a wide variety of shopping delights.Visitors can browse a wide variety of items, including handicrafts, trendy clothing and accessories, and souvenirs. Additionally, it's a fantastic location to sample regional street food and take in the vibrant atmosphere of one of Mumbai's most well-known shopping districts.<br><i>Opening time: Monday to Sunday, 10:00 am – 10:00 pm</i><br><br>",
    "blog1Content6":"<h2>5. Siddhivinayak Temple</h2><br>A well-known Hindu shrine to Lord Ganesha is situated in Prabhadevi, Mumbai. The temple draws millions of worshippers from all over the world and is renowned for its exquisite architecture.It is one of the most well-liked and spiritually significant places to visit during the ICC World Cup in Mumbai because it is thought that praying here results in good fortune and the fulfilment of wishes.<br><i>Opening time: 5:00 am – 8:45 pm</i><br><br>",
    "blog1Content7":"<h2>6. Elephanta Caves</h2><br>A UNESCO World Heritage Site is located at Elephanta Island, which can be reached from Mumbai by ferry in only a few minutes.The stunning sculptures and carvings honouring Lord Shiva can be found in these ancient rock-cut cave temples dating from the fifth to the eighth centuries.Visitors can explore a fascinating historical and cultural attraction in the main cave, the Great Cave, home to a sizable Trimurti sculpture depicting Brahma, Vishnu, and Shiva.<br><i>Opening time: 9:30 am to 5:30 pm. At 9 am and 2 pm, the first and last ferries depart.</i><br><br>",

    "blog2Title":"Top Must-Visit Travel Destinations in Incredible India",
    "blog2postby":"Posted By Durvesh Chaudhari on 03/02/2024",
    "blog2Content1":"India, a country of vivid colours, unique cultures, and rich history, entices visitors with a variety of alluring locations. There is a range of national parks, mountains, pristine beaches, and wildlife in India. Every type of traveller will have an unforgettable experience in this country, which is home to both historic sites of antiquity and breathtaking natural wonders.<br><br><h4>Let's take a tour of some of the Top 10 travel destinations in India.<h4><br><br>",
    "blog2Content2":"<h2>Varanasi, Uttar Pradesh: A Spiritual Journey</h2><br><img class='img-fluid' src='./assets/img/b21.jpg'/><br>Varanasi occupies a unique place in India's spiritual landscape because it is one of the oldest cities to have been continuously developed in the world. Varanasi, also called Kashi, is a spiritual haven for Hindus and is located along the revered Ganges River. The city, which is nestled along the holy Ganges River, is a hive of devotion, rituals, and spirituality. <br><br>The Ganga Aarti, a captivating evening ritual performed at the Dashashwamedh Ghat, is a transcendent experience that has a lasting effect on the soul. The city's narrow lanes, bustling with activity, and its ancient temples and ashrams contribute to the spiritual charm of Varanasi. Take a boat trip to the Ghats at sunrise, admire the mesmerising Ganga Aarti, and feel the mystical atmosphere. There are numerous spiritual sites besides the Ganges to visit, including the Shiva-dedicated Kashi Vishwanath Temple, the Bharat Mata Temple of Mother India, and Sarnath (The Deer Park), the location of Buddha's first sermon.<br><br><i>Best time to visit: November to February</i><br><br>",
    "blog2Content3":"<h2>Rishikesh, Uttarakhand: Yoga Capital and Adventure Center</h2><br><img class='img-fluid' src='./assets/img/b22.jpg'/><br>Rishikesh, which is tucked away in the Himalayan foothills, is a haven for adventure seekers in addition to being a spiritual haven. The city, which bills itself as the 'Yoga Capital of the World,' provides numerous yoga and meditation retreats to refresh the body and mind. In order to delve more deeply into the age-old practice of yoga and connect with their inner selves, aspiring yogis and spiritual seekers from all over the world travel to Rishikesh.Rishikesh is the starting point for white water rafting, bungee jumping, and trekking through the Himalayan trails for thrill-seekers, making it the ideal combination of tranquillity and adrenaline rush. Rishikesh is the best place for trekking in India.<br><br><i>Best time to visit: February to Mid-May</i><br><br>",
    "blog2Content4":"<h2>Taj Mahal, Agra: A Timeless Icon</h2><br><img class='img-fluid' src='./assets/img/b23.jpg'/><br>The iconic Taj Mahal, a UNESCO World Heritage Site, must be mentioned in any list of India's top tourist attractions. Emperor Shah Jahan erected this magnificent marble mausoleum in honour of his beloved wife, Mumtaz Mahal, and it stands as an everlasting representation of beauty and love. It is one of the most visited places in the world due to its intricate architecture and superb craftsmanship, which draw millions of tourists from all over the world. An experience that will live in your memory forever is seeing the Taj Mahal at sunrise or in the moonlight.The Agra Fort, Akbar's Tomb, and Fatehpur Sikri are three additional noteworthy historical locations in Agra.<br><br><i>Best time to visit: October to March</i><br><br>",
    "blog2Content5":"<h2>Jaipur, Rajasthan: The Pink City's Royal Grandeur</h2><br><img class='img-fluid' src='./assets/img/b24.jpg'/><br>In Jaipur, the state capital of Rajasthan, you can enter a world of nobility. Jaipur is a captivating fusion of history, architecture, and vibrant culture. It is affectionately referred to as the 'Pink City' because of its terracotta-coloured buildings.Examine the imposing Amer Fort, the majestic City Palace, and the intricate Hawa Mahal. Jaipur shopping is a memorable experience thanks to the vibrant bazaars, which are a treasure trove of handicrafts, textiles, and gemstones.Other magnificent forts and palaces can be found throughout Rajasthan, such as the hilltop Mehrangarh Fort in Jodhpur, which offers breathtaking views of the blue-painted houses of the old city.The Jaisalmer Fort in Jaisalmer, which is situated in the middle of the Thar Desert, and the City Palace in Udaipur, which is serenely perched on the banks of Lake Pichola.<br><br><i>Best time to visit: October to March</i><br><br>",
    "blog2Content6":"<h2>Kerala Backwaters: Serenity amidst Nature</h2><br><img class='img-fluid' src='./assets/img/b25.jpg'/><br>Kerala's backwaters offer a tranquil haven for tourists looking for peace and stunning natural scenery. A popular starting point for backwater cruises, Alleppey, also known as Alappuzha, immerses visitors in Kerala's natural splendour and cultural heritage.A singular and enthralling experience is provided by the interconnected system of rivers, lakes, and canals that are surrounded by verdant vegetation.You can experience authentic village life, indulge in delectable regional cuisine, and unwind amidst the picturesque surroundings on a houseboat cruise through the backwaters.<br><br><i>Best time to visit: September to March</i><br><br>",
    "blog2Content7":"<h2>Goa: Where Fun Meets Relaxation</h2><br><img class='img-fluid' src='./assets/img/b26.jpg'/><br>Goa, the smallest state in India, is a coastal paradise known for its gorgeous beaches, exciting nightlife, and relaxed atmosphere.Goa accommodates all tastes, whether you prefer relaxing on sandy beaches, enjoying water sports, or discovering Portuguese-influenced architecture.Travellers from India and abroad favour the state because of its distinctive fusion of cultures, mouthwatering seafood, monuments and exciting festivals.<br><br><i>Best time to visit: November to February</i><br><br>",

    "blog3Title":"Pune City- Cultural And Educational Capital Of Maharashtra",
    "blog3postby":"Posted By Durvesh Chaudhari on 02/02/2024",
    "blog3Content1":"Culture forms an important part of any state or community. A well-cultured person is always respected in this world. India has so many states with diverse cultures.Pune City is considered as Cultural And Educational Capital Of Maharashtra.<br>Pune is one of the most important cities in India. In Maharashtra, it ranks 2nd, next to Mumbai considering development.Pune has preserved certain old traditions. Pune is a city which is famous for -Culture and Historical places like:<br> 1. Shaniwarwada <br> 2. Lal Mahal <br> 3. Nehru Stadium for cricket matches. <br> 4. Peshve Park – Amusement park for children. <br> 5. Sarasbaug - Lord Ganesh's temple is situaled here.<br><br>",
    "blog3Content2":"<b>Certain features - Why people prefer Pune?</b><br>1. Safe Place to stay<br>Pune people are calm, quiet. They love peace. Pune is a cosmopolitan city. Pune has never experienced communal riots, bomb blasts.<br><br>2. Good climate:Pune's climate is one of the best in India. Its best in November, December, January,Summer is not very hot though nowadays temperature reacher 40 deg celcius due to pollution.Moderate rain is there fron June to Sept.. One can compare Pune's climate to Banglore though pollution is more in Banglore.<br><br>3. Affordable rates as far as flats are considered<br><br>4. Excellent connectivity to Mumbai, the financial capital of India<br><br> 5. Pune is industrial area. It has factories like- Garware, Kirloskar, Bajaj, Sandvik, etc which have given jobs.Preferred by retired people – earlier people used to call Pune as 'Pensioner's city'.Cultural Capital<br><br>Ganesh Kala Krida Manch –Every year cultural programmes are arranged in August- Sept. during Ganesh Chaturthi Festival time. Various artists like Lata Mangeshkar, Bhimsen Joshi, etc come here and perform. Pune's Ganesh Festival is famous all over Maharashtra.<br><br><b>Famous personalities who stayed in Pune:-</b><br>Shivaji Bhosale and his mother Jijabai Shivaji Bhosale was the great king who founded Maratha Empire and received a great respect.<br>Bhimsen Joshi – Famous singer. He is famous for his ' Bhajans and Abhangs ' – Religious songs <br>Purushottam Laxman Deshpande – Famous comedy stories writer <br>Suresh Kalmadi – former Union Railway Minister <br>Dhanraj Pillai –Hockey player<br>Hrishikesh Kanitkar- Cricket player<br><br><b>Famous Tourist Places In And Around Pune City And District</b><br>Junnar -Shivaji Bhosale's birth place is situated here 'Shivneri Fort'. It takes 2 hours to reach here from Pune.<br> Sinhgad – A famous fort which has a very important place in Maratha history. Tanaji Malusare's name is attached with this fort. It takes 1 hour to reach here from Pune.<br>Morgaon-This is included in 'Asthavinayaka' temples. Lord Ganesh's temple is situaled here. It takes 1and a half hour to reach here from Pune. Maharashtra has got 8 famous Ganesh temples. So it is called as 'Asthavinayaka'.Its a famous hill station. At week-ends , Puneites can enjoy here.<br><br>Matheran It's a famous hill station. At week-ends , Puneites can enjoy here.<br><br><b>Medical Colleges In And Around Pune:</b><br><br>1. B J Medical College , Pune - Govt<br>2. Armed Forces Medical College - Govt<br>3. Bharati Vidyapeeth's Medical College – Private, Deemed University<br>4. Medical College For Women At Pimpri- - Private5. MAEER's Medical College , Talegaon Dabhade- Private<br><br><b>Engineering Colleges In And Around Pune</b><br><br>1. College Of Engineering Pune ( COEP)- Govt<br>2. Bharati Vidyapeeth's Engineering College- Private<br>3. Vishwakarma Institute Of Technology ( VIT)- Private<br>4. Maharashtra Institute Of Technology ( MIT)- Private<br>5. Cummins College Of Engineering<br>6. Sinhgad College Of Engineering",

    "blog4Title":"A Trip To Ganpatipule in Konkan",
    "blog4postby":"Posted By Durvesh Chaudhari on 01/02/2024",
    "blog4Content1":"<b>Complete information on how to reach Ganpatipule, where to stay and when to visit.</b><br><br>Ganpatipule is located on the Konkan coastline in Ratnagiri district of Maharashtra. Ganpatipule is known for the sacred Ganpatipule temple and the dazzling Ganpatipule beach. A trip to Ganpatipule is a trip of sheer relaxation and calmness.<br><br><b>Ganpatipule</b><br><br><img class='img-fluid' src='./assets/img/b41.jpg'/><br><br>The natural unpolluted beauty of Ganpatipule leaves us completely spellbound. Ganpatipule is a small town with loads of history and cultural richness. The Ganpatipule temple is one of the most visited sacred destinations of India. Thousands of people from all over the world pay a visit to this place every year.<br><br>Reaching Ganpatipule:<br><br>By Air: The nearest airport for Ganpatipule is Belgaum which is around 299 km from Ganpatipule.<br><br>By Rail: The nearest rail station is Bhoke, which is around 35 km from Ganpatipule. But only local trains stop at this station. So the best station where one can get down and all major express and passenger trains halt at is Ratnagiri Station, which is exactly 45 km from Ganpatipule.<br><br>Once you get down at any station, say Ratnagiri or even Bhoke, then there are lots of intercity buses which ply regularly to Ganpatipule in huge frequency. Apart from that there are many buses which ply to Ganpatipule from various other cities like Mumbai, Pune, Kolhapur, Solapur and even Sangli. From Ratnagiri, one also has an option of hiring cabs or even private taxis for reaching this place.<br><br>By road: Ganpatipule is very well connected by roads to all major cities in Maharashtra. The distance between Mumbai and Ganpatipule is exactly 376 km. The distance between Pune and Ganpatipule is around 330 km and from Belgaum,Ganpatipule is 299 km away. From Mumbai,the Mumbai-Goa National Highway is the one you should take for Ganpatipule. However one needs to take a right from Sangameshwar from where Ganpatipule is almost 32 km. The right is to be taken right where the village Nivali is located in Sangameshwar.<br><br><b>Best Time to Visit:</b><br>The ideal time to visit this place is winters, when the climate is very pleasant and mostly it is very cold during nights. Summers are too hot and rough. But overall one can find this place full of visotors throughout the year, especially during summer vacations.<br><br>",
    
    "blog4Content2":"<b>Places to Visit nearby Ganpatipule:</b><br><br>Malgund: Malgund is a small village just 1 km away from Ganpatipule.This village is the hometown of one of the famous Marathi poet Keshavsoot.A beautiful monument is been constructed on this place.The Malgund beach is very beautiful and worth visiting.Malgund beach<br><br>Jaigad Fort: Jaigad Fort is located 34 km from Ganpatipule. This fort is really spectacular, as it stands tall on a cliff and looks majestic. One gets to walk along the fort walls and get to see the beautiful view of sea and Jaigad port from here.<br><br>Bhandarpule: Bhandarpule is another beautiful beach on the Konkan coastline, and is located just 3 km from Ganpatipule.<br><br><b>Festivals celebrated:</b><br><br>Two important festivals that are celebrated in great enthusiasm are Magh Chaturthi and Gauri Ganpati.<br><br><b>Where to stay:</b><br><br>MTDC Resort: The MTDC resort is an ideal location to stay when in Ganpatipule. It is located on a small hill and the view is fabulous from there. The resort also rents out cottages that give a splendid view of the sea, tents and Konkani houses.<br><br>Durwankur Hotel: This hotel is located just close to the temple and offers both a/c and non a/c accommodations. The rates charged for these accommodations are around Rs.1050/- per day.<br><br>Blue Ocean Resort and Spa: This hotel is located in Malgund and offers Portuguese style cottages and villas charging around Rs.6600/- per cottage or villa.",

    "blog5Title":"Top places to visit in Mahabaleshwar Maharashtra, India",
    "blog5postby":"Posted By Durvesh Chaudhari on 31/01/2024",
    "blog5Content1":"Mahabaleshwar is cuddled up among the Sahyadri mountain ranges and the scenic beauty of the place is the main attraction of the tourists. Earlier this beautiful city was considered as the summer capital of Mumbai and you can experience a deep impact of British architecture at this place. This hill station is the main preference of the nature lovers and the honey moon couples.<br><br><b>How to reach Mahabaleshwar</b><br><br>By air:Mahabaleshwar is located in the state of Maharashtra. There is no airport in Mahabaleshwar and the nearest airport is in Pune at the distance of 120 km from the destination. From Pune you can take taxi or bus to reach the place.<br>By bus:Bus service is available to reach Mahabaleshwar from Mumbai and Pune. The distance between the Mumbai and Mahabaleshwar is 247 km and buses are available from Dadar East, Sion and Vashi. It takes around six hours to reach the destination.<br>By train:Wather is the nearest railway station at the distance of 60 km from Mahabaleshwar. You can also reach Pune by train and from there take a taxi or car to reach the destination.<br>By road:By road you can reach Mahabaleshwar within 4 to 5 hours. Going by Mumbai-Pune expressway and then the highway from Pune to satara is the better option to reach faster.<br><br><b>Best time to visit Mahabaleshwar</b><br><br>The weather remains cool and refreshing throughout the year but during the summer season (March to June) weather remains very good to enjoy the place. Many visitors visit the place during this time to enjoy the pleasant atmosphere. The monsoon season starts from the mid of the June till the month of September. It rains very heavy in the place but this is the most preferred season for honeymoon couples as the place remains less crowded and peaceful. The winter season starts from the month of November. The winter remains pleasantly cold and you can enjoy this hill station during this time. The months from October to May are known as tourist season for Mahabaleshwar.<br><br><h2>Best places to visit in Mahabaleshwar</h2><br>",
    "blog5Content2":"<h3>#1Veena Lake</h3><br><br>It is the famous tourist place in Mahableshwar. The lake is the wonderful place surrounded by greenery and trees. The facility of boat riding is available here till the late evening. Early in the morning or in the evening you can spend some time at the lake side to enjoy the pleasant atmosphere and fresh weather. Tourists love to participate in fishing activities and mini train rides are available for the kids. There is no entry fees for this spot but you have to pay rent for the boat rides.<br><br><h3>#2Mapro Garden</h3><br><br>This is another famous tourist spot near to Mahabaleshwar. The place is mainly famous for the Strawberry plantation and annual strawberry festival is celebrated over here. Many items like Jams, marmalades, toppings, syrups and squashes made of strawberry are manufactured and sold here. Visitors can also enjoy fruits salads, strawberry milk shake and ice creams made from fresh strawberries from the garden. On this strawberry festival tourist can also enjoy the folk act of Shivkalin Dhol and Lezim. The festival is continued for 9 days and it is celebrated in the month of May. There is no entry fees charged for Marpo Garden.<br><br><h3>#3Lingamala Falls</h3><br><br>If you are a true nature lover then this is the best place for you. You need to walk through the forest to reach the falls. The Lingamala falls is the very good location for nature photography. Many visitors prefer the spot as the best for family picnic. The best time to visit the falls is from the month of July to December. During these months many tourists visit the place to enjoy the beauty of the falls. Here you can enjoy three beautiful waterfalls at the same place. The Dhobi Waterfall and the Chinaman's waterfall is near to Lingamala waterfall only. You can visit the place every day between 9 am to 6 pm. You need to pay Rs. 20 as a entry fees here.<br><br><h3>#4Elephant's head point</h3><br><br>The Elephant's head point is the part of mountain that look a lot like elephant's head. This is the reason, why the spot is known as Elephant's head point. The spot is also known as the Needle Point. The destination is a famous tourist spot and famous for the fresh and pleasant air, bright sunlight and surrounding scenic beauty. You can enjoy the energizing weather and a scenic view of the surrounding sahyadri range from the top of the place. You don't have to pay any entrance fees but you need to take lots of efforts while trekking.<br><br><h3>#5Mini Kashmir or Tapola</h3><br><br>>Mini Kashmir or Tapola is the beautiful place famous for the Shivsagar Lake situated over here. The spot is famous trekking spot among the nature lovers. The facility of boat riding is also available for the nature lovers. The place is surrounded by the different types of vegetation and visitors from all over the India come here to enjoy the company of nature. Adventure sports like boating, water scooter rides, kayaking and swimming are famous among the visitors. You can visit the lake any time during the day but the beauty of nature is worth seeing during sunset and sunrise. There is no entry fee for the destination",

    "blog6Title":"Unplanned trip to Hill Station Matheran",
    "blog6postby":"Posted By Durvesh Chaudhari on 27/01/2024",
    "blog6Content1":"This is going to be my first blog so I am sure I will not be looking professional but I will be sharing my experience, which will help you in deciding about this beautiful hill station called Matheran. We are a group of three people who came to Mumbai on a project for a period of 2months so every weekend we go and explore different places. This time as it was extended weekend Monday being off as it was May 1st we decided to head towards Matheran a hill station which lies amidst woods, greenery and large mansions.<br><br>Matheran lies in Raigad District, which is about 80kms from Mumbai. You have to take local train from Mumbai, which goes towards Khopoli, and get down at Neral, we also did the same. Other mode of transport is going on bike or car. We took a local, which started at 5.30PM from Mumbai CST and reached Neral at 7.30PM, as soon as you get down from the train you will see cab drivers approaching you asking for ₹ 80 per person for a drop to Dasturi, which is about 8kms from the station. Other way of reaching Matheran is by toy train, unfortunately, it is down from past 7months due to lack of maintenance of track. Cab will take about half an hour to reach Dasturi, the last point where cabs can go, from there Matheran is about 2.5 kms, you can cover by walk/trek, horse ride or take pull-cart.<br><br>We decided to walk and it took us half an hour to reach bazaar ghat. On the way you should be careful of horses as it will be dark(obviously as it was 8 PM) there are not many streetlights so you should either have good battery to use your phone's flash or should take a torch along with you. We reached and had our dinner at bazaar ghat, many hotels and resorts ply on this hill station, which can offer you best services. We had not decided on staying in a hotel or resort so instead we went to a hill point, which is named 'Echo Point' by the time we reached there it was 9.30. It will take 15mins from bazaar ghat to reach Echo Point and mind you the paths are damn scary and as it was, dark and we had heard many stories of ghosts, which haunt this hill station we were scared but we continued our journey, and along with us came a dog who accompanied us until next morning.",
    "blog6Content2":"Ones we reached the point we were mesmerized by the view, as it was dark we could see billions of stars and that silence was truly taking us into the wild. For half an hour, we three musketeers were simply sitting quiet and imbibing the beauty of nature, which is being taken away by urbanization and concrete jungle. We thought it would not be that cold so we did not take any sweaters or blankets but it was very cold and around 2 AM, we started campfire, which gave us a relief. We all had some 3AM talks, which are said to be sincere conversations, and slept off on benches. We were the only three over there and it was very scary but worth experiencing it. We woke up at 5.30 and fell in love with nature all over again.<br><br>Birds chirping singing morning songs, Fog setting up and covering the hills and cold breeze made us think how good the life would be with less urbanization. We took some pictures and headed for another point called as Lord's point. There is no protective grill here and soil can be slippery so we should be careful. In addition, you will see many monkeys here who will snatch away things. Near the same point on the other side, you will find a lake called as Charlotte lake. This lake is well maintained by the authorities and is clean. There are many points here like Louisa Point, 2kms from Bazaar ghat. We started our journey back from the lake from the woods crossing paths made of red soil, which is accumulated on face due to running horses. It was very scary at night to walk through the woods and in the morning, the same paths were so beautiful that you would not want to come back to the concrete jungle. ",

    "btntext":"Older Posts →",
    "footer":"Copyright &copy; TrekTales 2024",

    "atitle": "About Me",
    "aheading":"Exploring the world one adventure at a time, capturing moments and weaving stories along the way.",

    "acontent1":"Welcome to my travel universe! I'm Durvesh Chaudhari, an avid explorer, wanderer, and storyteller on a mission to unravel the beauty and diversity of Maharashtra and beyond. From the picturesque hill stations of the Western Ghats to the pristine beaches along the Konkan coast, Maharashtra holds a special place in my heart. Every journey I embark on is an opportunity to immerse myself in the rich culture, vibrant history, and breathtaking landscapes of this incredible state. But my wanderlust knows no bounds.",

    "acontent2":"While Maharashtra is my home base, I've also ventured across the length and breadth of India, from the majestic mountains of the Himalayas to the tranquil backwaters of Kerala. With each new destination, I uncover hidden gems, forge unforgettable memories, and enrich my understanding of the world around me. As a passionate photographer and storyteller, I believe that every journey is a story waiting to be told. Through my lens and words, I strive to capture the essence of each place I visit, from the hustle and bustle of vibrant cities to the serenity of remote villages",

    "acontent3":"Whether you're seeking travel inspiration, practical tips, or simply a virtual escape to far-off lands, my blog is your window to the world. Join me as I share my adventures, insights, and recommendations, and let's embark on a journey of discovery together. I'm thrilled to have you along for the ride! Feel free to reach out, share your own travel experiences, and join the conversation. Together, let's celebrate the beauty of travel and the boundless possibilities it brings.",

    "agreeting":"Happy Travels! - Durvesh Chaudhari",

    "chead":"Contat Me",
    "csubhead":"Have questions? I have answers.",
    "ccontent":"Want to get in touch? Fill out the form below to send me a message and I will get back to you as soon as possible!"

}